#+BEGIN_COMMENT
.. title: Holoviews: Investigating Save
.. slug: holoviews-investigating-save
.. date: 2024-03-28 17:27:47 UTC-07:00
.. tags: holoviews,exploration
.. category: Exploration
.. link: 
.. description: Exploring what holoviews.save does.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 1
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-f4f3eb79-1b65-4d3d-ba79-18646a70d0d4-ssh.json

#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC

* Starting

#+begin_src python :results none
from bokeh.sampledata.penguins import data
import hvplot.pandas
#+end_src

This is the example on [[https://hvplot.holoviz.org/][hvplot's home page]].

#+begin_src python :results none
plot = data.hvplot.scatter(x="bill_length_mm", y="bill_depth_mm", by="species")
#+end_src

#+begin_src python :results output :exports both
print(type(plot))
print(plot.__module__)
print(plot.__doc__)
#+end_src

#+RESULTS:
#+begin_example
<class 'holoviews.core.overlay.NdOverlay'>
holoviews.core.overlay
params(sort=Boolean, cdims=Dict, kdims=List, vdims=List, group=String, label=String, name=String)

    An NdOverlay allows a group of NdOverlay to be overlaid together. NdOverlay can
    be indexed out of an overlay and an overlay is an iterable that iterates
    over the contained layers.
    
[1;32mParameters of 'NdOverlay'
=========================
[0m
[1;31mParameters changed from their default values are marked in red.[0m
[1;36mSoft bound values are marked in cyan.[0m
C/V= Constant/Variable, RO/RW = ReadOnly/ReadWrite, AN=Allow None

[1;34mName            Value             Type     Bounds   Mode [0m

group        'NdMapping'         String             C RW 
label             ''             String             C RW 
cdims       OrderedDict()         Dict              V RW 
kdims   [Dimension('Element')]    List   (0, None)  C RW 
vdims             []              List     (0, 0)   C RW 
sort             True           Boolean    (0, 1)   V RW 

[1;32mParameter docstrings:
=====================[0m

[1;34mgroup: A string describing the data wrapped by the object.[0m
[1;31mlabel: Optional label describing the data, typically reflecting where[0m
[1;31m       or how it was measured. The label should allow a specific[0m
[1;31m       measurement or dataset to be referenced for a given group.[0m
[1;34mcdims: The constant dimensions defined as a dictionary of Dimension:value[0m
[1;34m       pairs providing additional dimension information about the object.[0m
[1;34m       [0m
[1;34m       Aliased with constant_dimensions.[0m
[1;31mkdims: List of dimensions the NdOverlay can be indexed by.[0m
[1;34mvdims: The value dimensions defined as the list of dimensions used to[0m
[1;34m       describe the components of the data. If multiple value[0m
[1;34m       dimensions are supplied, a particular value dimension may be[0m
[1;34m       indexed by name after the key dimensions.[0m
[1;34m       [0m
[1;34m       Aliased with value_dimensions.[0m
[1;31msort:  Whether the items should be sorted in the constructor.[0m
#+end_example

* Holoviews Save

#+begin_src python :results none
# pypi
import holoviews
#+end_src

#+begin_src python :results output :exports both
print(holoviews.save.__module__)
#+end_src

#+RESULTS:
: holoviews.util

#+begin_src python :results output :exports both
print(holoviews.util.save.__doc__)
#+end_src

#+RESULTS:
#+begin_example

    Saves the supplied object to file.

    The available output formats depend on the backend being used. By
    default and if the filename is a string the output format will be
    inferred from the file extension. Otherwise an explicit format
    will need to be specified. For ambiguous file extensions such as
    html it may be necessary to specify an explicit fmt to override
    the default, e.g. in the case of 'html' output the widgets will
    default to fmt='widgets', which may be changed to scrubber widgets
    using fmt='scrubber'.

    Arguments
    ---------
    obj: HoloViews object
        The HoloViews object to save to file
    filename: string or IO object
        The filename or BytesIO/StringIO object to save to
    fmt: string
        The format to save the object as, e.g. png, svg, html, or gif
        and if widgets are desired either 'widgets' or 'scrubber'
    backend: string
        A valid HoloViews rendering backend, e.g. bokeh or matplotlib
    resources: string or bokeh.resource.Resources
        Bokeh resources used to load bokehJS components. Defaults to
        CDN, to embed resources inline for offline usage use 'inline'
        or bokeh.resources.INLINE.
    toolbar: bool or None
        Whether to include toolbars in the exported plot. If None,
        display the toolbar unless fmt is `png` and backend is `bokeh`.
        If `True`, always include the toolbar.  If `False`, do not include the
        toolbar.
    title: string
        Custom title for exported HTML file
    ,**kwargs: dict
        Additional keyword arguments passed to the renderer,
        e.g. fps for animations
#+end_example

Looking at the code (defined in ~holoviews.util.__init__~) it uses another function defined in the same ~__init__~ file as ~save~ called ~renderer~ to get a renderer by using what looks like a dictionary: ~Store.renderers[name]~. ~Store~ is being imported from ~..core~.

* BokehRenderer

The bokeh renderer appears to be set in ~holoviews.plotting.bokeh.__init__.py~:

#+begin_src python
Store.renderers["bokeh"] = BokehRenderer.instance()
#+end_src


The ~BokehRenderer~ is defined in ~holoviews.plotting.bokeh.renderer.py~.
